import { useDispatch, useSelector } from 'react-redux';
import '../style/productDetails.css'
import { useEffect, useState } from 'react';
import defaultImage from '../images/defaultImg.jpg';
import { Button } from '@mui/material';
import { useParams } from 'react-router-dom';
import { getReq } from '../Api';
import { setSmartphone } from '../redux/smartphoneSlice';
import { useNavigate } from 'react-router-dom';

const ProductDetails = () => {
    const { id } = useParams();
    const { smartphone } = useSelector((state) => state.smartphone);
    const [imgSrc, setImgSrc] = useState(defaultImage);;
    const dispatch = useDispatch();
    const navigate = useNavigate();

    const handleError = () => {
        setImgSrc(defaultImage);
    };

    useEffect(() => {
        const getSmartponeById = async () => {
            try {
                const response = await getReq('/smartphones/' + id);
                if (response && response.id) {
                    dispatch(setSmartphone(response))
                }
            }
            catch (error) {
                navigate(`*`);
            }
        }
        if (!smartphone) {
            getSmartponeById()
        } else if (smartphone.image_url) {
            setImgSrc(smartphone.image_url);

        }

    }, [dispatch, smartphone, id]);

    if (!smartphone) {
        return <div>Loading...</div>;
    }

    return (
        <div className='pd-container'>
            <section className='main-info dt-section'>
                <div className='image-part'>
                    <img
                        src={imgSrc}
                        alt={`Изображение ${smartphone.title}`}
                        onError={handleError}
                        style={{
                            maxWidth: '100%',
                            maxHeight: '100%',
                            display: 'block',
                        }}
                    />
                </div>
                <div className='text-part'>
                    <h2>{smartphone.title}</h2>
                    <div className='main-info-text-cont'>
                        <h4 className='section-name'>Основная информация</h4>
                        <div className='main-info-parts'>
                            <div className='left-info'><p>Год Выхода - {smartphone.launch_year}</p>
                                <p>Диагональ дисплея - {smartphone.screen_size}</p>
                                <p>Разрешение главной камеры - {smartphone.main_camera_mp}</p>
                                <p>Аккумулятор - {smartphone.accum_volume}</p>
                                <p>Стоимость - {smartphone.price === '-' ? 'нет в наличии' : smartphone.price}</p></div>
                            <div className='right-info'>
                                <p>Версия ОС - {smartphone.os_version}</p>
                                <p>Процессор - {smartphone.cpu}</p>

                            </div>
                        </div>
                    </div>
                    <Button className='btn main-sec-btn' >
                        В корзину
                    </Button>
                </div>

            </section>
            <section className='display-sc dt-section'>
                <div className='text-part'>
                    <h2 className='section-name'>Дисплей</h2>
                    <p>Диагональ дисплея - {smartphone.screen_size}</p>
                    <p>Количество точек на дюйм - {smartphone.ppi}</p>
                    <p>Разрешение дисплея - {smartphone.screen_res}</p>
                    <p>Тип матрицы - {smartphone.screen_type}</p>
                    <p>Частота обновления экрана - {smartphone.screen_fps}</p>
                    <p>Тип стекла дисплея - {smartphone.screen_protector === '-' ? '?' : smartphone.screen_protector}</p>
                    <p>Соотношение сторон экрана - {smartphone.screen_ratio}</p>
                    <p>Количество цветов - {smartphone.color_count}</p>
                </div>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="250" height="500" viewBox="0 0 250 500" fill="none">
                        <rect x="3.5" y="3.5" width="243" height="493" rx="26.5" stroke="black" stroke-width="7" stroke-linejoin="round" />
                        <circle cx="125" cy="23" r="8.5" stroke="black" stroke-width="3" />
                        <line x1="239.676" y1="12.3257" x2="10.6756" y2="487.326" stroke="black" stroke-width="1.5" />
                        <circle cx="125.25" cy="249.75" r="1.375" stroke="black" stroke-width="2.75" />
                        <line x1="239.25" y1="22" x2="239.25" y2="15" stroke="black" stroke-width="1.5" />
                        <line x1="231.584" y1="18.376" x2="237.584" y2="14.376" stroke="black" stroke-width="1.5" />
                        <line x1="12.584" y1="485.376" x2="18.584" y2="481.376" stroke="black" stroke-width="1.5" />
                        <line x1="11.25" y1="485" x2="11.25" y2="477" stroke="black" stroke-width="1.5" />
                    </svg>
                </div>
            </section>

            <section className='camera-sc dt-section'>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="400" height="350" viewBox="0 0 400 350" fill="none">
                        <path d="M50 2.5H350C376.234 2.5 397.5 23.7665 397.5 50V347.5H2.5V50C2.5 23.7665 23.7665 2.5 50 2.5Z" stroke="black" stroke-width="5" />
                        <circle cx="72" cy="72" r="42.5" stroke="black" stroke-width="5" />
                        <circle cx="71.5" cy="72.5" r="19" stroke="black" stroke-width="5" />
                        <circle cx="160.5" cy="72.5" r="10" stroke="black" stroke-width="5" />
                        <line x1="28.5303" y1="27.4697" x2="177.53" y2="176.47" stroke="black" stroke-width="1.5" />
                        <line x1="177" y1="176.25" x2="250" y2="176.25" stroke="black" stroke-width="1.5" />
                        <circle cx="250.75" cy="176.25" r="1.375" stroke="black" stroke-width="2.75" />
                        <line x1="41" y1="39.75" x2="34" y2="39.75" stroke="black" stroke-width="1.5" />
                        <line x1="40.75" y1="33" x2="40.75" y2="40" stroke="black" stroke-width="1.5" />
                        <line x1="104" y1="103.25" x2="111" y2="103.25" stroke="black" stroke-width="1.5" />
                        <line x1="104.25" y1="110" x2="104.25" y2="103" stroke="black" stroke-width="1.5" />
                    </svg>
                </div>

                <div className='text-part'>
                    <h2 className='section-name'>Камера</h2>
                    <p>Разрешение главного модуля - {smartphone.main_camera_mp}</p>
                    <p>Количество модулей камеры - {smartphone.camera_count}</p>
                    <p>Типы модулей камеры - {smartphone.camera_type}</p>
                    <p>Максимальное разрешение видео - {smartphone.max_video_resolution}</p>
                    <p>Разрешение фронтальной камеры - {smartphone.front_camera_mp}</p>
                    <p>Апертура фронтальной камеры - {smartphone.front_camera_aperture}</p>
                    <p></p>
                    <p></p>
                    <p>Полная информация о модулях: {smartphone.camera_block}</p>
                </div>

            </section>
            <section className='soc-sc dt-section'>
                <div className='text-part'>
                    <h2 className='section-name'>Процессор</h2>
                    <p>Процессор - {smartphone.cpu}</p>
                    <p>Техпроцесс - {smartphone.tech_process}</p>
                    <p>Графический ускоритель - {smartphone.gpu === '-' ? '?' : smartphone.gpu}</p>
                </div>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="240" height="240" viewBox="0 0 240 240" fill="none">
                        <rect x="22.5" y="22.5" width="195" height="195" rx="7.5" stroke="black" stroke-width="5" />
                        <path d="M85.0909 102.091C84.8182 99.7879 83.7121 98 81.7727 96.7273C79.8333 95.4545 77.4545 94.8182 74.6364 94.8182C72.5758 94.8182 70.7727 95.1515 69.2273 95.8182C67.697 96.4848 66.5 97.4015 65.6364 98.5682C64.7879 99.7348 64.3636 101.061 64.3636 102.545C64.3636 103.788 64.6591 104.856 65.25 105.75C65.8561 106.629 66.6288 107.364 67.5682 107.955C68.5076 108.53 69.4924 109.008 70.5227 109.386C71.553 109.75 72.5 110.045 73.3636 110.273L78.0909 111.545C79.303 111.864 80.6515 112.303 82.1364 112.864C83.6364 113.424 85.0682 114.189 86.4318 115.159C87.8106 116.114 88.947 117.341 89.8409 118.841C90.7349 120.341 91.1818 122.182 91.1818 124.364C91.1818 126.879 90.5227 129.152 89.2045 131.182C87.9015 133.212 85.9924 134.826 83.4773 136.023C80.9773 137.22 77.9394 137.818 74.3636 137.818C71.0303 137.818 68.1439 137.28 65.7045 136.205C63.2803 135.129 61.3712 133.629 59.9773 131.705C58.5985 129.78 57.8182 127.545 57.6364 125H63.4545C63.6061 126.758 64.197 128.212 65.2273 129.364C66.2727 130.5 67.5909 131.348 69.1818 131.909C70.7879 132.455 72.5152 132.727 74.3636 132.727C76.5152 132.727 78.447 132.379 80.1591 131.682C81.8712 130.97 83.2273 129.985 84.2273 128.727C85.2273 127.455 85.7273 125.97 85.7273 124.273C85.7273 122.727 85.2955 121.47 84.4318 120.5C83.5682 119.53 82.4318 118.742 81.0227 118.136C79.6136 117.53 78.0909 117 76.4545 116.545L70.7273 114.909C67.0909 113.864 64.2121 112.371 62.0909 110.432C59.9697 108.492 58.9091 105.955 58.9091 102.818C58.9091 100.212 59.6136 97.9394 61.0227 96C62.447 94.0455 64.3561 92.5303 66.75 91.4545C69.1591 90.3636 71.8485 89.8182 74.8182 89.8182C77.8182 89.8182 80.4848 90.3561 82.8182 91.4318C85.1515 92.4924 87 93.947 88.3636 95.7955C89.7424 97.6439 90.4697 99.7424 90.5455 102.091H85.0909ZM139.722 113.727C139.722 118.636 138.835 122.879 137.062 126.455C135.29 130.03 132.858 132.788 129.767 134.727C126.676 136.667 123.146 137.636 119.176 137.636C115.206 137.636 111.676 136.667 108.585 134.727C105.494 132.788 103.063 130.03 101.29 126.455C99.517 122.879 98.6307 118.636 98.6307 113.727C98.6307 108.818 99.517 104.576 101.29 101C103.063 97.4242 105.494 94.6667 108.585 92.7273C111.676 90.7879 115.206 89.8182 119.176 89.8182C123.146 89.8182 126.676 90.7879 129.767 92.7273C132.858 94.6667 135.29 97.4242 137.062 101C138.835 104.576 139.722 108.818 139.722 113.727ZM134.267 113.727C134.267 109.697 133.593 106.295 132.244 103.523C130.911 100.75 129.1 98.6515 126.812 97.2273C124.54 95.803 121.994 95.0909 119.176 95.0909C116.358 95.0909 113.805 95.803 111.517 97.2273C109.244 98.6515 107.434 100.75 106.085 103.523C104.752 106.295 104.085 109.697 104.085 113.727C104.085 117.758 104.752 121.159 106.085 123.932C107.434 126.705 109.244 128.803 111.517 130.227C113.805 131.652 116.358 132.364 119.176 132.364C121.994 132.364 124.54 131.652 126.812 130.227C129.1 128.803 130.911 126.705 132.244 123.932C133.593 121.159 134.267 117.758 134.267 113.727ZM186.653 105H181.017C180.684 103.379 180.1 101.955 179.267 100.727C178.449 99.5 177.449 98.4697 176.267 97.6364C175.1 96.7879 173.805 96.1515 172.381 95.7273C170.956 95.303 169.472 95.0909 167.926 95.0909C165.108 95.0909 162.555 95.803 160.267 97.2273C157.994 98.6515 156.184 100.75 154.835 103.523C153.502 106.295 152.835 109.697 152.835 113.727C152.835 117.758 153.502 121.159 154.835 123.932C156.184 126.705 157.994 128.803 160.267 130.227C162.555 131.652 165.108 132.364 167.926 132.364C169.472 132.364 170.956 132.152 172.381 131.727C173.805 131.303 175.1 130.674 176.267 129.841C177.449 128.992 178.449 127.955 179.267 126.727C180.1 125.485 180.684 124.061 181.017 122.455H186.653C186.229 124.833 185.456 126.962 184.335 128.841C183.214 130.72 181.82 132.318 180.153 133.636C178.487 134.939 176.616 135.932 174.54 136.614C172.479 137.295 170.275 137.636 167.926 137.636C163.956 137.636 160.426 136.667 157.335 134.727C154.244 132.788 151.813 130.03 150.04 126.455C148.267 122.879 147.381 118.636 147.381 113.727C147.381 108.818 148.267 104.576 150.04 101C151.813 97.4242 154.244 94.6667 157.335 92.7273C160.426 90.7879 163.956 89.8182 167.926 89.8182C170.275 89.8182 172.479 90.1591 174.54 90.8409C176.616 91.5227 178.487 92.5227 180.153 93.8409C181.82 95.1439 183.214 96.7348 184.335 98.6136C185.456 100.477 186.229 102.606 186.653 105Z" fill="black" />
                        <line x1="58.5" y1="20" x2="58.5" stroke="black" stroke-width="3" />
                        <line x1="43.5" y1="20" x2="43.5" stroke="black" stroke-width="3" />
                        <line x1="73.5" y1="20" x2="73.5" stroke="black" stroke-width="3" />
                        <line x1="88.5" y1="20" x2="88.5" stroke="black" stroke-width="3" />
                        <line x1="103.5" y1="20" x2="103.5" stroke="black" stroke-width="3" />
                        <line x1="148.5" y1="20" x2="148.5" stroke="black" stroke-width="3" />
                        <line x1="133.5" y1="20" x2="133.5" stroke="black" stroke-width="3" />
                        <line x1="163.5" y1="20" x2="163.5" stroke="black" stroke-width="3" />
                        <line x1="178.5" y1="20" x2="178.5" stroke="black" stroke-width="3" />
                        <line x1="193.5" y1="20" x2="193.5" stroke="black" stroke-width="3" />
                        <line x1="118.5" y1="20" x2="118.5" stroke="black" stroke-width="3" />
                        <line x1="58.5" y1="240" x2="58.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="43.5" y1="240" x2="43.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="73.5" y1="240" x2="73.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="88.5" y1="240" x2="88.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="103.5" y1="240" x2="103.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="148.5" y1="240" x2="148.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="133.5" y1="240" x2="133.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="163.5" y1="240" x2="163.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="178.5" y1="240" x2="178.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="193.5" y1="240" x2="193.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="118.5" y1="240" x2="118.5" y2="220" stroke="black" stroke-width="3" />
                        <line x1="220" y1="193.5" x2="240" y2="193.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="178.5" x2="240" y2="178.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="163.5" x2="240" y2="163.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="148.5" x2="240" y2="148.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="133.5" x2="240" y2="133.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="118.5" x2="240" y2="118.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="103.5" x2="240" y2="103.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="88.5" x2="240" y2="88.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="73.5" x2="240" y2="73.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="58.5" x2="240" y2="58.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="43.5" x2="240" y2="43.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="193.5" x2="240" y2="193.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="178.5" x2="240" y2="178.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="163.5" x2="240" y2="163.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="148.5" x2="240" y2="148.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="133.5" x2="240" y2="133.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="118.5" x2="240" y2="118.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="103.5" x2="240" y2="103.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="88.5" x2="240" y2="88.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="73.5" x2="240" y2="73.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="58.5" x2="240" y2="58.5" stroke="black" stroke-width="3" />
                        <line x1="220" y1="43.5" x2="240" y2="43.5" stroke="black" stroke-width="3" />
                        <line y1="193.5" x2="20" y2="193.5" stroke="black" stroke-width="3" />
                        <line y1="178.5" x2="20" y2="178.5" stroke="black" stroke-width="3" />
                        <line y1="163.5" x2="20" y2="163.5" stroke="black" stroke-width="3" />
                        <line y1="148.5" x2="20" y2="148.5" stroke="black" stroke-width="3" />
                        <line y1="133.5" x2="20" y2="133.5" stroke="black" stroke-width="3" />
                        <line y1="118.5" x2="20" y2="118.5" stroke="black" stroke-width="3" />
                        <line y1="103.5" x2="20" y2="103.5" stroke="black" stroke-width="3" />
                        <line y1="88.5" x2="20" y2="88.5" stroke="black" stroke-width="3" />
                        <line y1="73.5" x2="20" y2="73.5" stroke="black" stroke-width="3" />
                        <line y1="58.5" x2="20" y2="58.5" stroke="black" stroke-width="3" />
                        <line y1="43.5" x2="20" y2="43.5" stroke="black" stroke-width="3" />
                    </svg>
                </div>
            </section>
            <section className='body-sc dt-section'>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="415" height="550" viewBox="0 0 415 550" fill="none">
                        <rect x="26.5" y="27.5" width="245" height="495" rx="27.5" stroke="black" stroke-width="5" stroke-linejoin="round" />
                        <line x1="27" y1="152.5" x2="270" y2="152.5" stroke="black" stroke-width="3" />
                        <path d="M87 117L147 117" stroke="black" stroke-width="50" stroke-linecap="round" />
                        <line x1="24" y1="82.5" x2="270" y2="82.5" stroke="black" stroke-width="3" />
                        <line x1="300" y1="25.75" y2="25.75" stroke="black" stroke-width="1.5" />
                        <line y1="524.25" x2="300" y2="524.25" stroke="black" stroke-width="1.5" />
                        <line x1="273.25" y1="550" x2="273.25" y2="-3.27835e-08" stroke="black" stroke-width="1.5" />
                        <line x1="340.75" x2="340.75" y2="550" stroke="black" stroke-width="1.5" />
                        <line x1="373.25" y1="550" x2="373.25" y2="-3.27835e-08" stroke="black" stroke-width="1.5" />
                        <line x1="24.75" y1="3.27835e-08" x2="24.75" y2="550" stroke="black" stroke-width="1.5" />
                        <path d="M355 26.5H347C343.962 26.5 341.5 28.9624 341.5 32V518C341.5 521.038 343.962 523.5 347 523.5H355C365.217 523.5 373.5 515.217 373.5 505V45C373.5 34.7827 365.217 26.5 355 26.5Z" stroke="black" stroke-width="3" />
                        <line x1="392.5" y1="81" x2="392.5" y2="154" stroke="black" stroke-width="3" />
                        <line x1="393" y1="82.5" x2="374" y2="82.5" stroke="black" stroke-width="3" />
                        <line x1="393" y1="152.5" x2="374" y2="152.5" stroke="black" stroke-width="3" />
                        <path d="M357 132L357 177" stroke="black" stroke-width="10" stroke-linecap="round" />
                        <path d="M357 212L357 307" stroke="black" stroke-width="10" stroke-linecap="round" />
                        <line x1="415" y1="25.75" x2="310" y2="25.75" stroke="black" stroke-width="1.5" />
                        <line x1="310" y1="524.25" x2="415" y2="524.25" stroke="black" stroke-width="1.5" />
                        <line x1="394" y1="153.25" x2="414" y2="153.25" stroke="black" stroke-width="1.5" />
                        <line x1="414" y1="81.75" x2="394" y2="81.75" stroke="black" stroke-width="1.5" />
                        <line x1="393.25" y1="81" x2="393.25" y2="61" stroke="black" stroke-width="1.5" />
                        <line x1="393.25" y1="174" x2="393.25" y2="154" stroke="black" stroke-width="1.5" />
                    </svg>
                </div>
                <div className='text-part'>

                    <h2 className='section-name'>Корпус</h2>
                    <p>Длина - {smartphone.length}</p>
                    <p>Ширина - {smartphone.width}</p>
                    <p>Толщина - {smartphone.thickness}</p>
                    <p>Вес - {smartphone.weight}</p>
                    <p>Материал задней панели - {smartphone.back_material}</p>
                    <p>Цвет задней панели - {smartphone.back_color}</p>
                    <p>Материал граней - {smartphone.edges_material}</p>
                    <p>Стандарт защиты - {smartphone.protection === '-' ? '?' : smartphone.protection}</p>
                </div>
            </section>
            <section className='accum-sc dt-section'>
                <div className='text-part'>
                    <h2 className='section-name'>Аккумулятор</h2>
                    <p>Объем аккумулятора - {smartphone.accum_volume}</p>
                    <p>Тип аккумулятора - {smartphone.accum_type}</p>
                    <p>Мощность зарадки - {smartphone.charging_power === '-' ? '?' : smartphone.charging_power}</p>
                    <p>Беспроводная зарядка - {smartphone.wireless_charging === '-' ? 'X' : smartphone.wireless_charging}</p>
                </div>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="300" height="500" viewBox="0 0 300 500" fill="none">
                        <rect x="2.5" y="2.5" width="295" height="495" rx="7.5" stroke="black" stroke-width="5" />
                        <rect x="27.75" y="3.75" width="7.5" height="22.5" stroke="black" stroke-width="7.5" />
                        <rect x="87.75" y="3.75" width="7.5" height="22.5" stroke="black" stroke-width="7.5" />
                        <rect x="57.75" y="3.75" width="7.5" height="22.5" stroke="black" stroke-width="7.5" />
                        <path d="M70.2273 250V215.091H82.4318C84.8636 215.091 86.8693 215.511 88.4489 216.352C90.0284 217.182 91.2045 218.301 91.9773 219.71C92.75 221.108 93.1364 222.659 93.1364 224.364C93.1364 225.864 92.8693 227.102 92.3352 228.08C91.8125 229.057 91.1193 229.83 90.2557 230.398C89.4034 230.966 88.4773 231.386 87.4773 231.659V232C88.5455 232.068 89.6193 232.443 90.6989 233.125C91.7784 233.807 92.6818 234.784 93.4091 236.057C94.1364 237.33 94.5 238.886 94.5 240.727C94.5 242.477 94.1023 244.051 93.3068 245.449C92.5114 246.847 91.2557 247.955 89.5398 248.773C87.8239 249.591 85.5909 250 82.8409 250H70.2273ZM74.4545 246.25H82.8409C85.6023 246.25 87.5625 245.716 88.7216 244.648C89.892 243.568 90.4773 242.261 90.4773 240.727C90.4773 239.545 90.1761 238.455 89.5739 237.455C88.9716 236.443 88.1136 235.636 87 235.034C85.8864 234.42 84.5682 234.114 83.0455 234.114H74.4545V246.25ZM74.4545 230.432H82.2955C83.5682 230.432 84.7159 230.182 85.7386 229.682C86.7727 229.182 87.5909 228.477 88.1932 227.568C88.8068 226.659 89.1136 225.591 89.1136 224.364C89.1136 222.83 88.5795 221.528 87.5114 220.46C86.4432 219.381 84.75 218.841 82.4318 218.841H74.4545V230.432ZM108.605 250.614C106.946 250.614 105.44 250.301 104.088 249.676C102.736 249.04 101.662 248.125 100.866 246.932C100.071 245.727 99.6733 244.273 99.6733 242.568C99.6733 241.068 99.9688 239.852 100.56 238.92C101.151 237.977 101.94 237.239 102.929 236.705C103.918 236.17 105.009 235.773 106.202 235.511C107.406 235.239 108.616 235.023 109.832 234.864C111.423 234.659 112.713 234.506 113.702 234.403C114.702 234.29 115.429 234.102 115.884 233.841C116.349 233.58 116.582 233.125 116.582 232.477V232.341C116.582 230.659 116.122 229.352 115.202 228.42C114.293 227.489 112.912 227.023 111.06 227.023C109.139 227.023 107.634 227.443 106.543 228.284C105.452 229.125 104.685 230.023 104.241 230.977L100.423 229.614C101.105 228.023 102.014 226.784 103.151 225.898C104.298 225 105.548 224.375 106.901 224.023C108.264 223.659 109.605 223.477 110.923 223.477C111.764 223.477 112.73 223.58 113.821 223.784C114.923 223.977 115.986 224.381 117.009 224.994C118.043 225.608 118.901 226.534 119.582 227.773C120.264 229.011 120.605 230.67 120.605 232.75V250H116.582V246.455H116.378C116.105 247.023 115.651 247.631 115.014 248.278C114.378 248.926 113.531 249.477 112.474 249.932C111.418 250.386 110.128 250.614 108.605 250.614ZM109.219 247C110.81 247 112.151 246.688 113.241 246.062C114.344 245.438 115.173 244.631 115.73 243.642C116.298 242.653 116.582 241.614 116.582 240.523V236.841C116.412 237.045 116.037 237.233 115.457 237.403C114.889 237.562 114.23 237.705 113.48 237.83C112.741 237.943 112.02 238.045 111.315 238.136C110.622 238.216 110.06 238.284 109.628 238.341C108.582 238.477 107.605 238.699 106.696 239.006C105.798 239.301 105.071 239.75 104.514 240.352C103.969 240.943 103.696 241.75 103.696 242.773C103.696 244.17 104.213 245.227 105.247 245.943C106.293 246.648 107.616 247 109.219 247ZM139.334 223.818V227.227H125.766V223.818H139.334ZM129.72 217.545H133.743V242.5C133.743 243.636 133.908 244.489 134.237 245.057C134.578 245.614 135.01 245.989 135.533 246.182C136.067 246.364 136.629 246.455 137.22 246.455C137.663 246.455 138.027 246.432 138.311 246.386C138.595 246.33 138.822 246.284 138.993 246.25L139.811 249.864C139.538 249.966 139.158 250.068 138.669 250.17C138.18 250.284 137.561 250.341 136.811 250.341C135.675 250.341 134.561 250.097 133.47 249.608C132.391 249.119 131.493 248.375 130.777 247.375C130.072 246.375 129.72 245.114 129.72 243.591V217.545ZM156.771 223.818V227.227H143.203V223.818H156.771ZM147.158 217.545H151.18V242.5C151.18 243.636 151.345 244.489 151.675 245.057C152.016 245.614 152.447 245.989 152.97 246.182C153.504 246.364 154.067 246.455 154.658 246.455C155.101 246.455 155.464 246.432 155.749 246.386C156.033 246.33 156.26 246.284 156.43 246.25L157.249 249.864C156.976 249.966 156.595 250.068 156.107 250.17C155.618 250.284 154.999 250.341 154.249 250.341C153.112 250.341 151.999 250.097 150.908 249.608C149.828 249.119 148.93 248.375 148.214 247.375C147.51 246.375 147.158 245.114 147.158 243.591V217.545ZM173.518 250.545C170.996 250.545 168.82 249.989 166.99 248.875C165.172 247.75 163.768 246.182 162.78 244.17C161.803 242.148 161.314 239.795 161.314 237.114C161.314 234.432 161.803 232.068 162.78 230.023C163.768 227.966 165.143 226.364 166.905 225.216C168.678 224.057 170.746 223.477 173.109 223.477C174.473 223.477 175.82 223.705 177.149 224.159C178.479 224.614 179.689 225.352 180.78 226.375C181.871 227.386 182.74 228.727 183.388 230.398C184.036 232.068 184.359 234.125 184.359 236.568V238.273H164.178V234.795H180.268C180.268 233.318 179.973 232 179.382 230.841C178.803 229.682 177.973 228.767 176.893 228.097C175.825 227.426 174.564 227.091 173.109 227.091C171.507 227.091 170.121 227.489 168.95 228.284C167.791 229.068 166.899 230.091 166.274 231.352C165.649 232.614 165.337 233.966 165.337 235.409V237.727C165.337 239.705 165.678 241.381 166.359 242.756C167.053 244.119 168.013 245.159 169.24 245.875C170.467 246.58 171.893 246.932 173.518 246.932C174.575 246.932 175.53 246.784 176.382 246.489C177.246 246.182 177.99 245.727 178.615 245.125C179.24 244.511 179.723 243.75 180.064 242.841L183.95 243.932C183.541 245.25 182.854 246.409 181.888 247.409C180.922 248.398 179.729 249.17 178.308 249.727C176.888 250.273 175.291 250.545 173.518 250.545ZM190.479 250V223.818H194.365V227.773H194.638C195.115 226.477 195.979 225.426 197.229 224.619C198.479 223.812 199.888 223.409 201.456 223.409C201.751 223.409 202.121 223.415 202.564 223.426C203.007 223.437 203.342 223.455 203.57 223.477V227.568C203.433 227.534 203.121 227.483 202.632 227.415C202.155 227.335 201.649 227.295 201.115 227.295C199.842 227.295 198.706 227.562 197.706 228.097C196.717 228.619 195.933 229.347 195.354 230.278C194.786 231.199 194.501 232.25 194.501 233.432V250H190.479ZM211.726 259.818C211.044 259.818 210.436 259.761 209.902 259.648C209.368 259.545 208.999 259.443 208.794 259.341L209.817 255.795C210.794 256.045 211.658 256.136 212.408 256.068C213.158 256 213.822 255.665 214.402 255.062C214.993 254.472 215.533 253.511 216.021 252.182L216.771 250.136L207.089 223.818H211.453L218.68 244.682H218.953L226.18 223.818H230.544L219.43 253.818C218.93 255.17 218.311 256.29 217.572 257.176C216.834 258.074 215.976 258.739 214.999 259.17C214.033 259.602 212.942 259.818 211.726 259.818Z" fill="black" />
                        <path d="M116.182 444.727L122.182 454.409H122.364L128.364 444.727H131.682L124.364 456.364L131.682 468H128.364L122.364 458.5H122.182L116.182 468H112.864L120.364 456.364L112.864 444.727H116.182ZM136.713 444.727L142.713 454.409H142.895L148.895 444.727H152.213L144.895 456.364L152.213 468H148.895L142.895 458.5H142.713L136.713 468H133.395L140.895 456.364L133.395 444.727H136.713ZM157.244 444.727L163.244 454.409H163.426L169.426 444.727H172.744L165.426 456.364L172.744 468H169.426L163.426 458.5H163.244L157.244 468H153.926L161.426 456.364L153.926 444.727H157.244ZM177.776 444.727L183.776 454.409H183.957L189.957 444.727H193.276L185.957 456.364L193.276 468H189.957L183.957 458.5H183.776L177.776 468H174.457L181.957 456.364L174.457 444.727H177.776ZM205.58 468V450.545H208.17V453.273H208.398C208.761 452.341 209.348 451.617 210.159 451.102C210.97 450.58 211.943 450.318 213.08 450.318C214.231 450.318 215.189 450.58 215.955 451.102C216.727 451.617 217.33 452.341 217.761 453.273H217.943C218.39 452.371 219.061 451.655 219.955 451.125C220.848 450.587 221.92 450.318 223.17 450.318C224.731 450.318 226.008 450.807 227 451.784C227.992 452.754 228.489 454.265 228.489 456.318V468H225.807V456.318C225.807 455.03 225.455 454.11 224.75 453.557C224.045 453.004 223.216 452.727 222.261 452.727C221.034 452.727 220.083 453.098 219.409 453.841C218.735 454.576 218.398 455.508 218.398 456.636V468H215.67V456.045C215.67 455.053 215.348 454.254 214.705 453.648C214.061 453.034 213.231 452.727 212.216 452.727C211.519 452.727 210.867 452.913 210.261 453.284C209.663 453.655 209.178 454.17 208.807 454.83C208.443 455.481 208.261 456.235 208.261 457.091V468H205.58ZM234.71 468H231.756L240.301 444.727H243.21L251.756 468H248.801L241.847 448.409H241.665L234.71 468ZM235.801 458.909H247.71V461.409H235.801V458.909ZM257.699 457.5V468H255.017V444.727H257.699V453.273H257.926C258.335 452.371 258.949 451.655 259.767 451.125C260.593 450.587 261.691 450.318 263.062 450.318C264.252 450.318 265.294 450.557 266.188 451.034C267.081 451.504 267.775 452.227 268.267 453.205C268.767 454.174 269.017 455.409 269.017 456.909V468H266.335V457.091C266.335 455.705 265.975 454.633 265.256 453.875C264.544 453.11 263.555 452.727 262.29 452.727C261.411 452.727 260.623 452.913 259.926 453.284C259.237 453.655 258.691 454.197 258.29 454.909C257.896 455.621 257.699 456.485 257.699 457.5Z" fill="black" />
                    </svg>
                </div>
            </section>
            <section className='interfaces-sc dt-section'>
                <div className='image-part'>
                    <svg xmlns="http://www.w3.org/2000/svg" width="166" height="328" viewBox="0 0 166 328" fill="none">
                        <path d="M80.5 0.666667C73.1362 0.666666 67.1667 6.6362 67.1667 14C67.1667 21.3638 73.1362 27.3333 80.5 27.3333C87.8638 27.3333 93.8333 21.3638 93.8333 14C93.8333 6.6362 87.8638 0.666667 80.5 0.666667ZM80.5 300.667C73.1362 300.667 67.1667 306.636 67.1667 314C67.1667 321.364 73.1362 327.333 80.5 327.333C87.8638 327.333 93.8333 321.364 93.8333 314C93.8333 306.636 87.8638 300.667 80.5 300.667ZM78 14L78 314L83 314L83 14L78 14Z" fill="#5C374C" />
                        <path d="M154 170C154.976 169.024 154.976 167.441 154 166.464C153.024 165.488 151.441 165.488 150.464 166.464L154 170ZM81.9999 242L154 170L150.464 166.464L78.4644 238.464L81.9999 242Z" fill="#5C374C" />
                        <path d="M149.5 168C149.5 169.381 150.619 170.5 152 170.5C153.381 170.5 154.5 169.381 154.5 168H149.5ZM152 90.3333C159.364 90.3333 165.333 84.3638 165.333 77C165.333 69.6362 159.364 63.6667 152 63.6667C144.636 63.6667 138.667 69.6362 138.667 77C138.667 84.3638 144.636 90.3333 152 90.3333ZM154.5 168V77H149.5V168H154.5Z" fill="#5C374C" />
                        <path d="M80.2322 155.768L14.2322 89.7678" stroke="#5C374C" stroke-width="5" stroke-linecap="round" />
                        <path d="M14 57.3333C21.3638 57.3333 27.3333 51.3638 27.3333 44C27.3333 36.6362 21.3638 30.6667 14 30.6667C6.6362 30.6667 0.666664 36.6362 0.666665 44C0.666665 51.3638 6.6362 57.3333 14 57.3333ZM16.5 90L16.5 44L11.5 44L11.5 90L16.5 90Z" fill="#5C374C" />
                    </svg>
                </div>
                <div className='text-part'>
                    <h2 className='section-name'>Интерфейсы</h2>
                    <p>Bluetooth - {smartphone.bluetooth}</p>
                    <p>Аудио раъем - {smartphone.audio_port}</p>
                    <p>Разъем подключения - {smartphone.charge_port}</p>
                    <p>Wi-Fi - {smartphone.wireless_charging}</p>
                    <p>NFC - {smartphone.nfc ? 'Есть' : 'Нет'}</p>
                    <p>5G - {smartphone._5g ? 'Есть' : 'Нет'}</p>
                </div>

            </section>
            {/* bluetooth = models.TextField()
    audio_port = models.TextField()
    charge_port = models.TextField()
    wifi = models.TextField()
    nfc = models.BooleanField()
    _5g = models.BooleanField() 
    sim_count = models.TextField()
    sim_type = models.TextField()
     */}
        </div>
    );
};


export default ProductDetails;

